www/emacs.html
<!doctype html>
<html lang="es">
<head>
<title>Importar Agenda a Emacs</title>
<!-- 2023-07-03 lun 15:44 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Christian Gimenez">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Header y Licencia</a></li>
<li><a href="#sec-2">2. Requires</a></li>
<li><a href="#sec-3">3. Constantes</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. controlz-url-calendario</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Importar en Emacs</a>
<ul class="nav">
<li><a href="#sec-4-1">4.1. controlz-download-events</a></li>
<li><a href="#sec-4-2">4.2. controlz-create-org-entry-from-event</a></li>
<li><a href="#sec-4-3">4.3. controlz-insert-org-from-events</a></li>
<li><a href="#sec-4-4">4.4. controlz-import-calendar-to-file</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Footer</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Importar Agenda a Emacs</h1>
<p>
Este archivo describe la biblioteca controlz.el para Emacs. Su objetivo es descargar el calendario, procesarlo y generar un buffer con los eventos. El buffer está pensado para funcionar con Org-mode.
</p>

<p>
Para usarlo, cargar controlz.el en Emacs y ejecutar <code>M-x controlz-import-calendar-to-buffer</code> para descargar los archivos JSON, convertirlos a Org-mode y mostrar el buffer con los resultados.
</p>

<p>
Se encuentran disponibles las siguientes versiones: <a href="emacs.html">Org-file</a>, HTML y <a href="controlz.el">controlz.el (tangled)</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Header y Licencia</h2>
<div class="outline-text-2" id="text-1">
<p>
Esta obra se encuentra bajo la licencia General Public License versión 3. 
</p>

<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #616e88;">;;; </span><span style="color: #677691;">controlz.el --- Download Control Z calendar -*- lexical-binding: t; -*-</span>

<span style="color: #616e88;">;; </span><span style="color: #677691;">Copyright 2023 cnngimenez</span>
<span style="color: #616e88;">;;</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">Author: cnngimenez</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">Maintainer: cnngimenez</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">Version: 0.1.0</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">Keywords: news</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">URL: https://github.com/cnngimenez/controlz-calendario</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">Package-Requires: ((emacs "27.1"))</span>

<span style="color: #616e88;">;; </span><span style="color: #677691;">This program is free software: you can redistribute it and/or modify</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">it under the terms of the GNU General Public License as published by</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">the Free Software Foundation, either version 3 of the License, or</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">(at your option) any later version.</span>

<span style="color: #616e88;">;; </span><span style="color: #677691;">This program is distributed in the hope that it will be useful,</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">but WITHOUT ANY WARRANTY; without even the implied warranty of</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">GNU General Public License for more details.</span>

<span style="color: #616e88;">;; </span><span style="color: #677691;">You should have received a copy of the GNU General Public License</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">along with this program.  If not, see <a href="https://www.gnu.org/licenses/">&lt;https://www.gnu.org/licenses/&gt;</a>.</span>


<span style="color: #616e88;">;;; </span><span style="color: #677691;">Commentary:</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">Funciones para descargar e importar a Emacs (Org-Mode) el calendario de</span>
<span style="color: #616e88;">;; </span><span style="color: #677691;">Control Z.</span>

<span style="color: #616e88;">;;; </span><span style="color: #677691;">Code:</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Requires</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">url-handlers</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Constantes</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> controlz-url-calendario&#xa0;&#xa0;&#xa0;<span class="tag"><span class="badge constant">constant</span></span></h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #81A1C1;">defconst</span> <span style="color: #ECEFF4;">controlz-url-calendario</span>
  <span style="color: #D08770;">"https://controlz.fi.uncoma.edu.ar/calendario/data/eventos.json"</span>
  <span style="color: #677691;">"URL a conectarse para descargar los eventos del calendario."</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Importar en Emacs</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> controlz-download-events&#xa0;&#xa0;&#xa0;<span class="tag"><span class="badge function">function</span></span></h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #81A1C1;">defun</span> <span style="color: #ECEFF4;">controlz-download-events</span> ()
  <span style="color: #677691;">"Descargar eventos desde la p&#225;gina Web.</span>
<span style="color: #677691;">Retornar el JSON parseado en un alist."</span>
  (<span style="color: #81A1C1;">with-temp-buffer</span>
    (url-insert-file-contents-literally controlz-url-calendario)
    (goto-char (point-min))
    (json-parse-buffer <span style="color: #81A1C1;">:object-type</span> 'alist)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> controlz-create-org-entry-from-event&#xa0;&#xa0;&#xa0;<span class="tag"><span class="badge function">function</span></span></h3>
<div class="outline-text-3" id="text-4-2">
<p>
Debe existir una función para procesar un JSON y obtener el string a insertar. Por consecuencia, esta función retorna dicho string, y considera que:
</p>

<ul class="org-ul">
<li><code>[X]</code> si la fecha de inicio y fin es la misma, solo utiliza un timestamp,
</li>
<li><code>[&#xa0;]</code> si hay una clave <code>rec_type</code> (evento con repetición), agregar la repetición en el timestamp.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #81A1C1;">defun</span> <span style="color: #ECEFF4;">controlz-create-org-entry-from-event</span> (json-event)
  <span style="color: #677691;">"Crear una entrada Org-mode desde un evento.</span>
<span style="color: #677691;">Crear un string con una entrada Org-mode producida desde el JSON.</span>
<span style="color: #677691;">JSON-EVENT es un alist parseada desde el JSON de la p&#225;gina."</span>
  (<span style="color: #81A1C1;">let</span> ((start (alist-get 'start_date json-event))
        (end (alist-get 'end_date json-event)))
    (<span style="color: #81A1C1;">if</span> (string= start end)
        (format <span style="color: #D08770;">"\n* %s    :%s:\n    &lt;%s&gt;\n"</span>
                (alist-get 'text json-event)
                (alist-get 'type json-event)
                start)
      (format <span style="color: #D08770;">"\n* %s    :%s:\n    &lt;%s&gt;--&lt;%s&gt;\n"</span>
              (alist-get 'text json-event)
              (alist-get 'type json-event)
              start end))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> controlz-insert-org-from-events&#xa0;&#xa0;&#xa0;<span class="tag"><span class="badge function">function</span></span></h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #81A1C1;">defun</span> <span style="color: #ECEFF4;">controlz-insert-org-from-events</span> (json-events)
  <span style="color: #677691;">"Insert org entries per event in the current buffer.</span>
<span style="color: #677691;">JSON-EVENTS es un array con el parseo del JSON del calendario.</span>
<span style="color: #677691;">Utilizar `</span><span style="color: #81A1C1;">controlz-download-events</span><span style="color: #677691;">'."</span>
  (mapc (<span style="color: #81A1C1;">lambda</span> (event)
          (insert (controlz-create-org-entry-from-event event)))
        json-events))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> controlz-import-calendar-to-file&#xa0;&#xa0;&#xa0;<span class="tag"><span class="badge function">function</span>&#xa0;<span class="badge interactive">interactive</span></span></h3>
<div class="outline-text-3" id="text-4-4">
<p>
Básicamente, utiliza las funciones anteriores para descargar, procesar y mostrar los resultados.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #81A1C1;">defun</span> <span style="color: #ECEFF4;">controlz-import-calendar-to-buffer</span> ()
  <span style="color: #677691;">"Download the calendar and save the events in a buffer."</span>
  (<span style="color: #81A1C1;">interactive</span>)
  (<span style="color: #81A1C1;">with-current-buffer</span> (get-buffer-create <span style="color: #D08770;">"Control Z - Calendar"</span>)
    (org-mode)
    (controlz-insert-org-from-events (controlz-download-events))
    (switch-to-buffer-other-window (current-buffer))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Footer</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #81A1C1;">provide</span> '<span style="color: #81A1C1;">controlz</span>)
<span style="color: #616e88;">;;; </span><span style="color: #677691;">controlz.el ends here</span>
</pre>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="date">Fecha: 03 jul 2023</p>
<p class="author">Autor: Christian Gimenez</p>
<p class="date">Created: 2023-07-03 lun 15:44</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="http://orgmode.org">Org-mode</a> 9.6.2)</p>
</div>
</footer>
</body>
</html>